[
  {
    "bookid": "1",
    "title": "Harry Potter series",
    "description": "Harry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's struggle against Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic and subjugate all wizards and Muggles (non-magical people)."
  },
  {
    "bookid": 2,
    "title": "Flipped",
    "description": "Flipped is a romance told in two voices. The first time Juli Baker saw Bryce Loski, she flipped. The first time Bryce saw Juli, he ran. That's pretty much the pattern for these two neighbors until the eighth grade, when, just as Juli is realizing Bryce isn't as wonderful as she thought, Bryce is starting to see that Juli is pretty amazing. How these two teens manage to see beyond the surface of things and come together makes for a comic and poignant romance. Flipped Jump to Edit Summaries Two eighth-graders start to have feelings for each other despite being total opposites. In 1957, when second-graders Bryce Loski and Julianna"
  },
  {
    "bookid": 3,
    "title": "The Hunger Games Trilogy",
    "description": "Could you survive on your own in the wild, with every one out to make sure you don't live to see the morning? In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love"
  },
  {
    "bookid": 4,
    "title": "The Hobbit - There and Back Again",
    "description": "J.R.R. Tolkien's classic prelude to his Lord of the Rings trilogy. Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum. Written for J.R.R. Tolkien's own children, The Hobbit has sold many millions of copies worldwide and established itself as a modern classic."
  },
  {
    "bookid": 5,
    "title": "The Lord of the Rings Trilogy",
    "description": "The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider. The Fellowship of the Ring debuted around the world on Dec. 19, 2001. And over the last 20 years, the trilogy, adapted from J.R.R. Tolkien’s sprawling work by Peter Jackson, Fran Walsh, Philippa Boyens, has held the attention of our collective cultural consciousness. With so much that could have gone wrong, so much about the films went right, making them perfect subject for a year-long deep dive. There’s no one way to talk about The Lord of the Rings movies, and in celebrating The Fellowship of the Ring’s anniversary, the Polygon staff dared not try. Instead, we set out to tell a story a week, sizing up the fantasy triptych from every angle."
  },
  {
    "bookid": 6,
    "title": "The Dark Elf Trilogy",
    "description": "R. A. Salvatore's prequel to the Icewind Dale trilogy follow Drizzt Do'Urden from his birth to his new life on the surface many years later. Key times and events within those years are visited throughout the three books (see list below). Many details about his home city of Menzoberranzan, drow society and politics, education, and Drizzt himself are revealed of the course of several years as the elf grows and becomes more aware of himself as an individual. Morals and principles are a big struggle for Drizzt in this prequel trilogy, adding depth and giving more understanding to the character."
  },
  {
    "bookid": 7,
    "title": "The Old Man and the Sea",
    "description": "The Old Man and the Sea is the story of a battle between an old, experienced fisherman, Santiago, and a large marlin. The novel opens by telling the reader that Santiago has gone 84 days without catching a fish, considered salao, the worst form of unluckiness. He is so unlucky that his young apprentice, Manolin, has been forbidden by his parents to sail with him and been told to, instead, fish with successful fishermen. The boy visits Santiago's shack each night, hauling his fishing gear, preparing food, talking about American baseball and his favorite player Joe DiMaggio. Santiago tells Manolin that on the next day, he will venture far out into the Gulf Stream, north of Cuba in the Straits of Florida to fish, confident that his unlucky streak is near its end."
  },
  {
    "bookid": 8,
    "title": "The adventures of Robinson Crusoe",
    "description": "Robinson Crusoe, in full The Life and Strange Surprizing Adventures of Robinson Crusoe, of York, Mariner: Who Lived Eight and Twenty Years, All Alone in an Un-inhabited Island on the Coast of America, Near the Mouth of the Great River of Oroonoque; Having Been Cast on Shore by Shipwreck, Wherein All the Men Perished but Himself. With an Account how he was at last as Strangely Deliver’d by Pyrates. Written by Himself...novel by Daniel Defoe, first published in London in 1719. Defoe’s first long work of fiction, it introduced two of the most-enduring characters in English literature: Robinson Crusoe and Friday."
  },
  {
    "bookid": 9,
    "title": "Jane Eyre",
    "description": "Jane Eyre is a first-person narrative of the title character, a small, plain-faced, intelligent and honest English orphan. The novel goes through five distinct stages — Janes childhood at Gateshead, where she is abused by her aunt and cousins; her education at Lowood Academy, where she acquires friends and role models but also suffers privations; her time as the governess of Thornfield Manor, where she falls in love with her Byronic employer, Edward Rochester; her time with the Rivers family at Marshs End (or Moor House) and Morton, where her cold clergyman-cousin St John Rivers proposes to her; and her reunion with and marriage to her beloved Rochester at his house of Ferndean. Partly autobiographical, the novel abounds with social criticism and sinister Gothic elements.Jane Eyre is divided into 38 chapters; most editions are at least 400 pages long (although the preface and introduction on certain copies are liable to take up another 100). The original was published in three volumes — Volume One (comprising chapters one to fifteen), Volume Two (sixteen to 26) and Volume Three (27 to 38)."
  },
  {
    "bookid": 10,
    "title": "Wuthering Heights",
    "description": "Nothing about the reception of Emily Brontë’s first and only published novel, Wuthering Heights, in 1847 suggested that it would grow to achieve its now-cult status. While contemporary critics often admitted its power, even unwillingly responding to the clarity of its psychological realism, the overwhelming response was one of disgust at its brutish and brooding Byronic hero, Heathcliff, and his beloved Catherine, whose rebellion against the norms of Victorian femininity neutered her of any claim to womanly attraction."
  },
  {
    "bookid": 11,
    "title": "Agnes Grey",
    "description": "Agnes Grey is the daughter of a clergyman whose financial imprudence leads to the family's ruin. The women take charge, but Agnes fears that, being the baby of the family, she will be prevented from making any real contribution, and insists on seeking work as a governess.Agnes Grey, novel by Anne Brontë, published in 1847. The strongly autobiographical narrative concerns the travails of a rector’s daughter in her service as governess, first to the unruly Bloomfield children and then to the callous Murrays."
  },
  {
    "bookid": 12,
    "title": "The Tenant of Wildfell Hall",
    "description": "Tenant of Wildfell Hall by Anne Bronte. The Tenant of Wildfell Hall is a powerful and sometimes violent novel of expectation, love, oppression, sin, religion and betrayal. It portrays the disintegration of the marriage of Helen Huntingdon, the mysterious tenant of the title, and her dissolute, alcoholic husband. Defying convention, Helen leaves her husband to protect their young son from his father's influence, and earns her own living as an artist. Whilst in hiding at Wildfell Hall, she encounters Gilbert Markham, who falls in love with her. On its first publication in 1848, Anne Brontë's second novel was criticised for being 'coarse' and 'brutal'. The Tenant of Wildfell Hall challenges the social conventions of the early nineteenth century in a strong defence of women's rights in the face of psychological abuse from their husbands. Anne Brontë's style is bold, naturalistic and passionate, and this novel, which her sister Charlotte considered 'an entire mistake', has earned her a position in English Literature in her own right."
  },
  {
    "bookid": 13,
    "title": "Gone with the Wind",
    "description": "Scarlett O'Hara, the beautiful, spoiled daughter of a well-to-do Georgia plantation owner, must use every means at her disposal to claw her way out of the poverty she finds herself in after Sherman's March to the Sea. The manipulative daughter of a Georgia plantation owner conducts a turbulent romance with a roguish profiteer during the American Civil War and Reconstruction periods. Gone With the Wind is the famous and controversial American novel by American writer, Margaret Mitchell. Here, she draws us into the lives and experiences of myriad colorful characters during"
  },
  {
    "bookid": 14,
    "title": "A Song of Ice and Fire",
    "description": "The series comprises one epic story that is still being written. Intended to be complete in seven volumes, the author has stated it could go on for longer. Some of the books have been adapted into a series of Graphic Novels.Martin has also written A History of the Targaryen Dynasty set 300 years before the series, as well as a prequel series called The Tales of Dunk and Egg. A Song of Ice and Fire (commonly abbreviated as ASoIaF) is an ongoing series of epic fantasy novels by American novelist and screenwriter George R. R. Martin. Martin began writing the series in 1991 and the first volume was published in 1996. Originally planned as a trilogy, the series now consists of five published volumes; a further two are planned. In addition there are three prequel novellas currently available, with several more being planned, and a series of novella-length excerpts from the main Ice and Fire novels."
  },
  {
    "bookid": 15,
    "title": "The Twilight Saga",
    "description": "Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a “literary phenomenon” and redefined romance for a generation.Isabella Swan’s move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella’s life takes a thrilling and terrifying turn.Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife -- between desire and danger.Deeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite."
  },
  {
    "bookid": 16,
    "title": "Charlie and the Chocolate Factory",
    "description": "Charlie Bucket, the novel’s protagonist, is a little boy who lives with his parents, Mr. Bucket and Mrs. Bucket, and both sets of grandparents (Grandma Georgina, Grandpa George, Grandma Josephine, and Grandpa Joe), who spend all their time lying in the one bed the family can afford. The Bucket family is extremely poor, as Mr. Bucket is the only one who’s employed. They live in a tiny, drafty two-room house and subsist on cabbage and potatoes. What Charlie wants most in the world is chocolate—so his walk to and from school every day is torturous, as he has to pass Mr. Wonka’s chocolate factory each way.Every night, Charlie’s grandparents tell him stories. One night, Grandpa Joe tells Charlie about Mr. Wonka and his chocolate factory. Mr. Wonka is a genius inventor—he once made a palace entirely out of chocolate for an Indian prince. His factory used to employ local workers, but Mr. Wonka suddenly shut the factory down when spies kept stealing his candy recipes. After a closure of several years, the factory suddenly came to life again and resumed production. Nobody knows who works there, as the gates are perpetually locked; Mr. Wonka and his factory are totally mysterious."
  },
  {
    "bookid": 17,
    "title": "The Kite Runner",
    "description": "The narrative follows two friends, Amir—who narrates in the first person—and Hassan. Although they do not know it when the narrative begins, Amir and Hassan are half-brothers by the same father, Baba, who lied to hide a secret affair he had with his servant’s wife. Hassan is an ethnic Hazara and a Shi’a Muslim, while Amir, the protagonist, is Pashtun. Although they exist in separate strata of society, the two are inseparable. When Amir runs afoul of Assef, a blond, blue-eyed Pashtun, Hassan appears from behind Amir with his slingshot and threatens to take Assef’s left eye if he does not leave them alone. This encounter begins a cycle of violence that cascades through the novel, spanning out into their adult lives.In the wintertime in Kabul, neighborhood children compete in a kite fighting tournament wherein kite fighters position their glass string to cut rival kites out of the sky. Kite runners chase the last kite of a tournament, a coveted trophy. When Amir wins the kite fighting tournament in the winter of 1975, Amir and Hassan are briefly separated in the frenzy of celebration. Amir finds Hassan cornered in a blind alley by Assef, having run the last kite. Assef pins and rapes Hassan, but Amir never intervenes and never tells anyone, consumed by his want of the kite—in his eyes, a token through which he can gain Baba’s affection. "
  },
  {
    "bookid": 18,
    "title": "The Wind in the Willows",
    "description": "The tales relate the adventures of several animal friends and neighbours in the English countryside—primarily Mole, Rat, Toad, and Badger. Although the animals converse, philosophize, and behave like humans, each creature also retains its distinctive animal habits. The story begins when Mole decides to go to the riverbank one morning rather than do his spring cleaning. There he comes across his friend Rat, a water rat, and they spend the spring and summer together. One day they visit the irrepressible, generous, and boastful Mr. Toad, owner of Toad Hall, who possesses large amounts of money but not much brain. Toad is given to fads, and Mole and Rat join him in an excursion in his present enthusiasm, a horse-drawn caravan (a cart with beds and cooking equipment), until a speeding automobile frightens the horse and wrecks the caravan. Toad is mesmerized by the car. Mole and Rat later go to the Wild Wood to visit the kindly and responsible Badger, to whom they report that Toad has bought and smashed several automobiles."
  },
  {
    "bookid": 19,
    "title": "The Giver - Lois Lowry",
    "description": "This book tells the story of an eleven-year-old boy named Jonas who lives in a futuristic society. Jonas’ world is run by a group called The Elders who decide every aspect of everyone’s life. They choose who a person will marry, what job they will have, and if they will have children. In this society, everyone is equal: there is no war, pain, or poverty. However, there is also no individualism, emotion, color, joy, or love. Jonas is assigned the job “The Receiver of Memory” and is trained by a man known as The Giver. The Giver’s role is to pass down and store memories of humanity from before the society was formed. Jonas receives memories of joy, pain, war, love, sex, etc. and learns what emotion is. He also learns a dark secret about his world: The Elders kill the elderly, sick, and rebellious by lethal injection. When Jonas learns that an ill baby in his family’s care is going to be killed, he escapes the community with the child. The novel’s ending suggests that Jonas and the baby starve to death."
  },
  {
    "bookid": 20,
    "title": "Pride and Prejudice",
    "description": "Pride and Prejudice by Jane Austen is a romantic novel of manners written in 1813. Originally titled as ‘First Impressions’ and published as three volumes, it throws light upon the character progress of Elizabeth Bennet and Fitzwilliam Darcy. Pride and Prejudice by Jane Austen is a romantic novel of manners written in 1813. Originally titled as ‘First Impressions’ and published as three volumes, it throws light upon the character progress of Elizabeth Bennet and Fitzwilliam Darcy. It is a classical piece of Literature with a detailed description of characters, and their manners, in 19th century rural England."
  },
  {
    "bookid": 21,
    "title": "The Chronicles of Narnia",
    "description": "Digory and Polly discover a secret passage that links their houses, and are tricked into vanishing out of this world and into the World of Charn, where they wake up the evil Queen Jadis. There, they witness the creation of the Land of Narnia, as it is sung into being by the Great Lion, Aslan. On a daring quest to save a life, two friends are hurled into another world, where an evil sorceress seeks to enslave them. But then the lion Aslan's song weaves itself into the fabric of a new land, a land that will be known as Narnia. And in Narnia, all things are possible. The Lion, the Witch and the Wardrobe is the second book in C. S. Lewis's The Chronicles of Narnia, a series that has become part of the canon of classic literature, drawing readers of all ages into a magical land with unforgettable characters for over fifty years. On a desperate journey, two runaways meet and join forces. Though they are only looking to escape their harsh and narrow lives, they soon find themselves at the center of a terrible battle. It is a battle that will decide their fate and the fate of Narnia itself."
  },
  {
    "bookid": 22,
    "title": "The Chrysanthemum and The Sword",
    "description": "Essential reading for anyone interested in Japanese culture, this unsurpassed masterwork explores the political, religious, and economic life of Japan.The World War II–era study by the cultural anthropologist Ruth Benedict paints an illuminating contrast between the culture of Japan and that of the United States. The Chrysanthemum and the Sword is a revealing look at how and why our cultures differ, making it the perfect introduction to Japanese history and customs.This influential book shaped American ideas about Japanese culture during the occupation of Japan, and popularized the distinction between guilt cultures and shame cultures."
  },
  {
    "bookid": 23,
    "title": "Snow Crash - Neal Stephenson",
    "description": "Hiro lives in a Los Angeles where franchises line the freeway as far as the eye can see. The only relief from the sea of logos is within the autonomous city-states, where law-abiding citizens don’t dare leave their mansions. Hiro delivers pizza to the mansions for a living, defending his pies from marauders when necessary with a matched set of samurai swords. His home is a shared 20 X 30 U-Stor-It. He spends most of his time goggled in to the Metaverse, where his avatar is legendary. But in the club known as The Black Sun, his fellow hackers are being felled by a weird new drug called Snow Crash that reduces them to nothing more than a jittering cloud of bad digital karma (and IRL, a vegetative state). Investigating the Infocalypse leads Hiro all the way back to the beginning of language itself, with roots in an ancient Sumerian priesthood. He’ll be joined by Y.T., a fearless teenaged skateboard courier. Together, they must race to stop a shadowy virtual villain hell-bent on world domination."
  },
  {
    "bookid": 24,
    "title": "The Moon And Sixpence",
    "description": "A novel by W Somerset Maugham, told in episodic form by a first-person narrator, in a series of glimpses into the mind and soul of the central character Charles Strickland, a middle-aged English stockbroker, who abandons his wife and children abruptly to pursue his desire to become an artist. The story is said to be loosely based on the life of the painter Paul Gauguin. The inspiration for this story, Gauguin, is considered to be the founder of primitivism in art. The main differences between Gauguin and Strickland are that Gauguin was French rather than English, and whilst Maugham describes the character of Strickland as being largely ignorant of his contemporaries in Modern art, as well as largely ignorant of other artists in general, Gauguin himself was well acquainted with and exhibited with the Impressionists in the 1880s and lived for a while with Van Gogh in southern France."
  },
  {
    "bookid": 25,
    "title": "How an Economy Grows and Why it Crashes",
    "description": "Economic expert and bestselling author of Crash Proof and The Little Book of Bull Moves in Bear Markets, Peter Schiff, presents economics in two informative, yet thoroughly entertaining tales. The illustrations were previously published by Peter Schiff's father, Irwin A. Schiff, a trader and financial expert. The book takes complex economic issues and distills them into a rousing allegory. For example, a story takes place on a tropical island where hunter-gatherer cavemen struggle daily to catch fish for basic survival. As the economy of the island becomes increasingly dynamic, institutions and government entities develop to protect the islanders' savings and assets, and Schiff explains the complexities that accompany this growth. With wit and humor, Schiff explains the roots of economic growth, the uses of capital, the destructive nature of consumer credit, and many other topical principles of economic theory. The tales leave you with a powerful understanding of inflation and the abuses of the monetary system. How an Economy Grows is an insightful illustrated book that both entertains and teaches readers about the economic system."
  },
  {
    "bookid": 26,
    "title": "Oliver Twist",
    "description": "Oliver Twist begins in a workhouse in 1830s England, in an unnamed village, where a young woman, revealed to be Oliver's mother, gives birth to her son and promptly dies. The boy, lucky to survive, is raised until the age of nine in a “farm” for young orphaned children, and then is sent to the local workhouse again, where he labors for a time, until his innocent request for more food so angers the house's board and beadle, Mr. Bumble, that the workhouse attempts to foist Oliver off as an apprentice to some worker in the villager. Oliver is eventually given over to a coffin-maker named Sowerberry. Oliver works as a “mute” mourner for Sowerberry, and must sleep at night among the coffins. After a fight with Noah, another of Sowerberry's apprentices, over Oliver's unwed mother (whom Noah insults), Oliver runs away to London, to make his fortune."
  },
  {
    "bookid": 27,
    "title": "Charlotte’s Web",
    "description": "Eight-year-old Fern Arable is devastated when she hears that her father is going to kill the runt of his pig’s new litter. Persuading him that the piglet has a right to life and promising to look after it, she saves the animal and names him Wilbur. When Wilbur becomes too large, Fern is forced to sell him to her uncle, Homer Zuckerman, whose barn is filled with animals who shun the newcomer. When Wilbur discovers that he will soon be slaughtered for Christmas dinner, he is horribly distraught. He sits in the corner of the barn crying, “I don’t want to die.” Charlotte—the hairy barn spider who lives in the rafters above his sty—decides to help him. With the assistance of a sneaky rat named Templeton and some of the other animals in the barn, she writes a message in her web: “Some Pig.” More strange messages appear in the web, sparking people from miles around to visit these “divine” manifestations and the pig that inspired them. Charlotte accompanies Wilbur to the county fair, where she spins her last note: “Humble.” Wilbur wins a special prize, and his survival is ensured."
  },
  {
    "bookid": 28,
    "title": "Ulysses",
    "description": "All the action of Ulysses takes place in and immediately around Dublin on a single day (June 16, 1904). The three central characters—Stephen Dedalus (the hero of Joyce’s earlier Portrait of the Artist as a Young Man); Leopold Bloom, a Jewish advertising canvasser; and his wife, Molly—are intended to be modern counterparts of Telemachus, Ulysses (Odysseus), and Penelope, respectively, and the events of the novel loosely parallel the major events in Odysseus’s journey home after the Trojan War. The book begins at 8:00 in the morning in a Martello tower (a Napoleonic-era defensive structure), where Stephen lives with medical student Buck Mulligan and his English friend Haines. They prepare for the day and head out. After teaching at a boys’ school, Stephen receives his pay from the ignorant and anti-Semitic headmaster, Mr. Deasy, and takes a letter from Deasy that he wants to have published in two newspapers. Afterward Stephen wanders along a beach, lost in thought."
  },
  {
    "bookid": 29,
    "title": "The Disappearance of Childhood",
    "description": "From the vogue for nubile models to the explosion in the juvenile crime rate, this modern classic of social history and media traces the precipitous decline of childhood in America today−and the corresponding threat to the notion of adulthood. Deftly marshaling a vast array of historical and demographic research, Neil Postman, author of Technopoly, suggests that childhood is a relatively recent invention, which came into being as the new medium of print imposed divisions between children and adults. But now these divisions are eroding under the barrage of television, which turns the adult secrets of sex and violence into popular entertainment and pitches both news and advertising at the intellectual level of ten-year-olds. Informative, alarming, and aphorisitc, The Disappearance of Childhood is a triumph of history and prophecy."
  },
  {
    "bookid": 30,
    "title": "The Great Gatsby",
    "description": "Set in Jazz Age New York, it tells the tragic story of Jay Gatsby, a self-made millionaire, and his pursuit of Daisy Buchanan, a wealthy young woman whom he loved in his youth. The book is narrated by Nick Carraway, who recounts the events of the summer of 1922, after he takes a house in the fictional village of West Egg on Long Island. There he lives among the newly rich, while across the water, in the more refined village of East Egg, live his cousin Daisy and her brutish wealthy husband, Tom Buchanan. As the summer progresses, Nick is finally invited to attend one of the dazzling parties held by Jay Gatsby, his neighbour. At Gatsby’s request, Nick invites Daisy to his house, where she and Gatsby meet again and renew their relationship. Tom soon becomes aware of the affair and confronts Gatsby at the Plaza Hotel. Daisy tries to calm them down, but Gatsby insists that he and Daisy have always been in love and that she has never loved Tom. As the fight escalates, Tom reveals what he had learned from an investigation into Gatsby’s affairs—that he had earned his money by selling illegal alcohol."
  },
  {
    "bookid": 31,
    "title": "Men are from Mars, Women are from Venus",
    "description": "In this classic guide to understanding the opposite sex, Dr. John Gray provides a practical and proven way for men and women to improve their communication by acknowledging the differences between their needs, desires, and behaviors. Once upon a time Martians and Venusians met, fell in love, and had happy relationships together because they respected and accepted their differences. Then they came to Earth and amnesia set in: they forgot they were from different planets. Based on years of successful counseling of couples and individuals, Men Are from Mars, Women Are from Venus has helped millions of couples transform their relationships. Now viewed as a modern classic, this timeless book has helped men and women realize how different they can be in their communication styles, their emotional needs, and their modes of behavior—and offers the secrets of communicating without conflicts, allowing couples to give intimacy every chance to grow. "
  },
  {
    "bookid": 32,
    "title": "How to Write a Novel Using the Snowflake Method",
    "description": "before you start writing, you need to get organized. You need to put all those wonderful ideas down on paper in a form you can use. Why? Because your memory is fallible, and your creativity has probably left a lot of holes in your story — holes you need to fill in before you start writing your novel. You need a design document. And you need to produce it using a process that doesn’t kill your desire to actually write the story. Here is my ten-step process for writing a design document. I use this process for writing my novels, and I hope it will help you. Step 1 Take an hour and write a one-sentence summary of your novel. Step 2 Take another hour and expand that sentence to a full paragraph describing the story setup, major disasters, and ending of the novel. Step 3 The above gives you a high-level view of your novel. Step 4) By this stage, you should have a good idea of the large-scale structure of your novel, and you have only spent a day or two. Step 5 Take a day or two and write up a one-page description of each major character and a half-page description of the other important characters. Step 6..."
  },
  {
    "bookid": 33,
    "title": "A Tale of Two Cities",
    "description": "The year is 1775. On a mission for his employer, Tellson's Bank, Mr. Jarvis Lorry travels to Dover to meet Lucie Manette. On his way, Mr. Lorry receives a mysterious message and replies with the words “Recalled to life.” When they meet, Mr. Lorry reveals to Lucie that her father, Dr. Alexandre Manette, who she thought was dead, is still alive. Dr. Manette had been secretly imprisoned for 18 years in the Bastille, but his former servant Monsieur Defarge, who now owns a wine shop in Paris that is a center of revolutionary activities, has smuggled Dr. Manette out of prison and hidden him in the store's attic. Meanwhile, Defarge's wife, Madame Defarge, secretly encodes the names of the Revolution's enemies into her knitting. Mr. Lorry and Lucie arrive in Paris to find Manette compulsively making shoes in a dark corner—prison has left him insane. Lucie lovingly restores him to himself and they return to London."
  },
  {
    "bookid": 34,
    "title": "Revolutionary Road",
    "description": "Richard Yates’s novel Revolutionary Road was published in 1961 and was a finalist for the National Book Award in 1962, along with Joseph Heller’s Catch-22 and Walker Percy’s The Moviegoer, which won the award. The book was Yates’s first novel, though he had worked as a journalist and ghostwriter, writing some of John F. Kennedy’s speeches following his service in the US Army during World War II. In a 1976 interview for the literary journal Ploughshares, Yates commented about the underlying theme of the novel as an indictment of American society in the 1950s, when there was a strong urge for conformity and desperation for safety and security at any price. In 2008, Sam Mendes directed a film version of the book also titled, Revolutionary Road, starring Leonardo DiCaprio and Kate Winslet. This guide follows the 2007 Vintage Classics edition of Revolutionary Road."
  },
  {
    "bookid": 35,
    "title": "The Giver of Stars - Jojo Moyes",
    "description": "Set in Depression-era America, a breathtaking story of five extraordinary women and their remarkable journey through the mountains of Kentucky and beyond. Alice Wright marries handsome American Bennett Van Cleve hoping to escape her stifling life in England. But small-town Kentucky quickly proves equally claustrophobic, especially living alongside her overbearing father-in-law. So when a call goes out for a team of women to deliver books as part of Eleanor Roosevelt’s new traveling library, Alice signs on enthusiastically. The leader, and soon Alice's greatest ally, is Margery, a smart-talking, self-sufficient woman who's never asked a man's permission for anything. They will be joined by three other singular women who become known as the Packhorse Librarians of Kentucky."
  },
  {
    "bookid": 36,
    "title": "Me Before You - Jojo Moyes",
    "description": "Lou Clark knows lots of things. She knows how many footsteps there are between the bus stop and home. She knows she likes working in The Buttered Bun tea shop and she knows she might not love her boyfriend Patrick. What Lou doesn’t know is she’s about to lose her job or that knowing what’s coming is what keeps her sane. Will Traynor knows his motorcycle accident took away his desire to live. He knows everything feels very small and rather joyless now and he knows exactly how he’s going to put a stop to that. What Will doesn’t know is that Lou is about to burst into his world in a riot of colour. And neither of them knows they’re going to change the other for all time."
  },
  {
    "bookid": 37,
    "title": "After You - Jojo Moyes",
    "description": "Louisa Clark is no longer just an ordinary girl living an ordinary life. After the transformative six months spent with Will Traynor, she is struggling without him. When an extraordinary accident forces Lou to return home to her family, she can't help but feel she's right back where she started. Her body heals, but Lou herself knows that she needs to be kick-started back to life. Which is how she ends up in a church basement with the members of the Moving On support group, who share insights, laughter, frustrations, and terrible cookies. They will also lead her to the strong, capable Sam Fielding - the paramedic, whose business is life and death, and the one man who might be able to understand her. Then a figure from Will's past appears and hijacks all her plans, propelling her into a very different future...For Lou Clark, life after Will Traynor means learning to fall in love again, with all the risks that brings. But here Jojo Moyes gives us two families, as real as our own, whose joys and sorrows will touch you deeply, and where both changes and surprises await."
  },
  {
    "bookid": 38,
    "title": "Tell Me Your Dreams - Sidney Sheldon",
    "description": "The main characters of the book are Ashley Patterson, an introverted workaholic, her co-workers, Toni Prescott, an outgoing singer and dancer, and shy artist Alette Peters and Ashley's father, Dr. Steven Patterson. The three women do not get along very well, because of their dissimilar natures. Toni and Alette generally maintain a friendship, with Alette a calming influence, but Toni dislikes Ashley and criticizes her harshly. All three have issues with their mothers having told them they'd never amount to anything. Ashley fears that somebody is following her. She finds her house lights turned on when she returns from work, her personal effects in disarray, and someone has written “You will die” on her mirror with a lipstick. She thinks someone's broken into her house. She requests a police escort, but the next morning, the police officer assigned to this duty is found dead in her apartment. Two other murders have already taken place, with an identical pattern. All the murdered men had been castrated and were having sex before being murdered. Evidence points to the same woman being involved in all three cases. When a gift from one of the murdered men to Toni is found among Ashley's things, she is identified as the killer and arrested. At this point, it is revealed that the three women are three selves of a woman suffering from multiple personality disorder."
  },
  {
    "bookid": 39,
    "title": "The Pearl by John Steinbeck",
    "description": "The Pearl takes place in a small village on the outskirts of La Paz, California. It begins in the brush house of Kino, Juana, and their baby, Coyotito, a family of Mexican Native Americans. In the midst of Kino and Juana’s morning routine, Coyotito is stung by a scorpion that has fallen into his hanging box. Aware of how poisonous the scorpion’s sting is, Juana orders that the doctor be gotten and when the doctor refuses to come to them, insists they go to the doctor themselves. Kino, Juana, Coyotito, and their neighbors proceed together to the city. When the servant reports their arrival at his gate, the doctor, lounging indulgently in bed, is insulted by the mere notion that he would “cure insect bites for ‘little Indians’” without compensation. The servant informs Kino that the doctor will not be able to see them and Kino punches the gate, infuriated by the doctor’s evident discrimination."
  },
  {
    "bookid": 40,
    "title": "If Tomorrow Comes by Sidney Sheldon",
    "description": "This is a high-octane, sexy thriller that keeps the reader on tip-toe throughout, trying to guess what the next plot twist will be. It is the story of an average American woman, Tracy Whitney, who sets out to avenge her mother's suicide resulting from the loss of her business to con men and criminals in New Orleans. Against seemingly impossible odds, Tracy outwits these career criminals and one by one leads them to their own destruction through clever con games of her own. Her anger sated by these acts of revenge, Tracy is drawn subtly into another world of criminality peopled by hustlers, flim-flam artists, burglars and assorted other human parasites. She finds that she has a real gift for this line of work, and soon becomes one of the most wanted female criminals in the world—a one-woman crime wave who never does physical violence to anyone but who lives by outsmarting those who would capture or co-opt her. Tracy's satisfaction in executing high-risk, high-reward schemes grows exponentially until it is the central driving force, or addiction, of her life. Her relationships with men are largely superficial one-nighters; it seems she is incapable of truly loving anyone but herself."
  },
  {
    "bookid": 41,
    "title": "The Theory of Everything: The Origin and Fate of the Universe",
    "description": "The Theory of Everything by Stephen Hawking is a series of seven lectures. This book presents the most complex theories about black holes, expanding the universe, the origin of everything, the direction of time, and the big bang. He briefly describes the universe's ideas from Aristotle, Newton, Einstien, Augustine, Hubble, Friedman, Galileo, and many more scientists and philosophers. For example, in 1928, an Indian, Subrahmanyan Chandrasekhar, calculated that a cold star of more than about one and a half times the sun's mass would not be able to support itself against its own gravity. This mass is now known as the Chandrasekhar limit. Why don't we notice all the extra dimensions if they are really there? Why do we see only three spaces and only one facet? The suggestions are that the other dimensions are curved up into a space of tiny size, something like a million million million million millionth of an inch. This is so small that we just don't notice it."
  },
  {
    "bookid": 42,
    "title": "The Hunt for Red October - Tom Clancy",
    "description": "published October 1, 1984, is the first novel written by Tom Clancy. Jack Ryan, a CIA analyst based in London, flies to Washington, DC, to meet with Deputy Director of Intelligence James Greer. Ryan has photographs of a new, state-of-the-art Soviet ballistic missile submarine, Red October. Ryan points out small doors on the sides of the submarine that are unusual and gets permission to speak to a friend at Annapolis, Skip Tyler, to get an idea as to what they might be. This friend identifies them as a silent drive system, referred to as a tunnel system, that the US attempted to develop some years before but decided was too inefficient to put into use. Ryan asks him to run a computer simulation that will tell them how well the system on Red October might function. Before Tyler can provide the information, the CIA receives intelligence from a Soviet spy that the Red October is at sea and possibly missing. Ryan reviews the information and suggests the Red October’s captain, Marko Ramius, might be attempting to defect. In a meeting with the president and Joint Chiefs, Ryan explains his theory. The men present are excited by the idea of obtaining the submarine, but the president warns that the prospect of keeping the Red October if Ramius arrives on American shores safely is slim, because it is unlikely that all the crew members wish to defect. If those who do not wish to stay returned and told the Soviets that the Americans kept their property, it could cause conflict between the two countries."
  },
  {
    "bookid": 43,
    "title": "A song for Lya And Other Stories - George R. R. Martin",
    "description": ""
  },
  {
    "bookid": 44,
    "title": "Dreamsongs - George R.R. Martin",
    "description": ""
  },
  {
    "bookid": 45,
    "title": "The new optimum nutrition bible - Patrick Holford",
    "description": ""
  },
  {
    "bookid": 46,
    "title": "Hall of Mirrors：The Great Depression, The Great Recession, and the Uses—and Misuses—of History",
    "description": "The two great financial crises of the past century are the Great Depression of the 1930s and the Great Recession, which began in 2008. Both occurred against the backdrop of sharp credit booms, dubious banking practices, and a fragile and unstable global financial system. When markets went into cardiac arrest in 2008, policymakers invoked the lessons of the Great Depression in attempting to avert the worst. While their response prevented a financial collapse and catastrophic depression like that of the 1930s, unemployment in the U.S. and Europe still rose to excruciating high levels. Pain and suffering were widespread. Why didn't policymakers do better? Hall of Mirrors, Barry Eichengreen's monumental twinned history of the two crises, provides the farthest-reaching answer to this question to date. Alternating back and forth between the two crises and between North America and Europe, Eichengreen shows how fear of another Depression following the collapse of Lehman Brothers shaped policy responses on both continents, with both positive and negative results. Since bank failures were a prominent feature of the Great Depression, policymakers moved quickly to strengthen troubled banks. But because derivatives markets were not important in the 1930s, they missed problems in the so-called shadow banking system. Having done too little to support spending in the 1930s, governments also ramped up public spending this time around. But the response was indiscriminate and quickly came back to haunt overly indebted governments, particularly in Southern Europe. Moreover, because politicians overpromised, and because their measures failed to stave off a major recession, a backlash quickly developed against activist governments and central banks. Policymakers then prematurely succumbed to the temptation to return to normal policies before normal conditions had returned. The result has been a grindingly slow recovery in the United States and endless recession in Europe."
  },
  {
    "bookid": 47,
    "title": "A Tree Grows in Brooklyn",
    "description": ""
  },
  {
    "bookid": 48,
    "title": "Adventures of Sherlock Holmes - Arthur Conan Doyle",
    "description": ""
  },
  {
    "bookid": 49,
    "title": "Fantastic Mr Fox by Roald Dahl",
    "description": ""
  },
  {
    "bookid": 50,
    "title": "Dune by Frank Herbert",
    "description": ""
  },
  {
    "bookid": 51,
    "title": "Magic Tree House series",
    "description": "Dinosaurs Before Dark, The Knight at Dawn, Mummies in the Morning, Pirates Past Noon, Night of the Ninjas, Afternoon on the Amazon, Sunset of the Sabertooth, Midnight on the Moon, Dolphins at Daybreak, Ghost Town at Sundown, Lions at Lunchtime, Polar Bears Past Bedtime, Vacation Under the Volcano, Day of the Dragon King, Viking Ships at Sunrise, Hour of the Olympics, Tonight on the Titanic, Buffalo Before Breakfast, Tigers at Twilight, Dingoes at Dinnertime, Civil War on Sunday, Revolutionary War on Wednesday, Twister on Tuesday, Earthquake in Early Morning, Stage Fright on a Summer Night, Good Morning, Gorillas, Thanksgiving on Thursday, High Tide in Hawaii, Christmas in Camelot, Haunted Castle on Hallows Eve, Summer of the Sea Serpent, Winter of the Ice Wizard, Carnival at Candlelight, Season of the Sandstorms, Night of the New Magicians, Blizzard of the Blue Moon, Dragon of the Red Dawn, Monday with a Mad Genius, Dark Day in the Deep Sea, Eve of the Emperor Penguin, Moonlight on the Magic, Leprechaun in Late Winter, Leprechaun in Late Winter, A Ghost Tale for Christmas Time, A Crazy Day With Cobras"
  },
  {
    "bookid": 52,
    "title": "Skunk Works by Ben Rich",
    "description": ""
  },
  {
    "bookid": 53,
    "title": "The 48 Laws of Power by Robert Greene",
    "description": ""
  },
  {
    "bookid": 54,
    "title": "The Silmarillion by J.R.R. TOLKIEN",
    "description": ""
  },
  {
    "bookid": 55,
    "title": "Fluent in 3 Months：How Anyone at Any Age Can Learn to Speak Any Language from Anywhere in the World",
    "description": ""
  },
  {
    "bookid": 56,
    "title": "Wonder by Robert J. Sawyer",
    "description": ""
  },
  {
    "bookid": 57,
    "title": "Putin's Wars：From Chechnya to Ukraine",
    "description": ""
  },
  {
    "bookid": 58,
    "title": "The Pillars of the Earth by Ken Follett",
    "description": ""
  },
  {
    "bookid": 59,
    "title": "World Without End by Ken Follett",
    "description": ""
  },
  {
    "bookid": 60,
    "title": "A Column of Fire by Ken Follett",
    "description": ""
  },
  {
    "bookid": 61,
    "title": "Maps of Time：An Introduction to Big History",
    "description": ""
  },
  {
    "bookid": 62,
    "title": "The Poverty of Historicism by Routledge & Kegan Paul",
    "description": ""
  },
  {
    "bookid": 63,
    "title": "Anne of Green Gables by Lucy Maud Montgomery",
    "description": ""
  },
  {
    "bookid": 64,
    "title": "Connect：Building Exceptional Relationships with Family, Friends, and Colleagues",
    "description": ""
  },
  {
    "bookid": 65,
    "title": "Telling the Truth About History by Joyce Appleby, Lynn Hunt, and Margaret Jacob",
    "description": ""
  },
  {
    "bookid": 66,
    "title": "Guns，Germs，and Steel：The Fates of Human Societies",
    "description": ""
  },
  {
    "bookid": 67,
    "title": "The Naked Ape：A Zoologist’s Study of the Human Animal by Desmond Morris",
    "description": ""
  },
  {
    "bookid": 68,
    "title": "The Human Zoo：A Zoologist's Classic Study of the Urban Animal by Desmond_Morris",
    "description": ""
  },
  {
    "bookid": 69,
    "title": "Intimate Behaviour：A Zoologist's Classic Study of Human Intimacy",
    "description": ""
  },
  {
    "bookid": 70,
    "title": "A Short History of Nearly Everything by Bryson",
    "description": ""
  },
  {
    "bookid": 71,
    "title": "Misery by Stephen King",
    "description": ""
  },
  {
    "bookid": 72,
    "title": "Ageless：The New Science of Getting Older Without Getting Old",
    "description": ""
  },
  {
    "bookid": 73,
    "title": "Elon Musk：RISKING IT ALL by Michael Vlismas",
    "description": ""
  },{
    "bookid": 74,
    "title": "To Kill a Mockingbird by Harper Lee",
    "description": ""
  },{
    "bookid": 75,
    "title": "Out of the Gobi：My Story of China and America by Weijian Shan",
    "description": ""
  },{
    "bookid": 76,
    "title": "Money Games 2nd Edition by Weijian Shan",
    "description": ""
  },{
    "bookid": 77,
    "title": "The Battle for Your Brain：Defending the Right to Think Freely in the Age of Neurotechnology",
    "description": ""
  },{ 
    "bookid": 78,
    "title": "",
    "description": ""
  },{
    "bookid": 79,
    "title": "Animal Farm：A Fairy Story by George Orwell",
    "description": ""
  },{
    "bookid": 80,
    "title": "The Three-Body Problem by Cixin Liu",
    "description": ""
  },{
    "bookid": 81,
    "title": "My Voice Will Go with You：The Teaching Tales of Milton H. Erickson",
    "description": ""
  },
  {
    "bookid": 82,
    "title": "Building Nextjs Application",
    "description": ""
  },{
    "bookid": 83,
    "title": "",
    "description": ""
  },{
    "bookid": 84,
    "title": "",
    "description": ""
  },{
    "bookid": 85,
    "title": "",
    "description": ""
  },{
    "bookid": 86,
    "title": "",
    "description": ""
  },{
    "bookid": 87,
    "title": "",
    "description": ""
  },
  {
    "bookid": 1984,
    "title": "1984 By George Orwell",
    "description": ""
  }
]
