const fs = require('fs');

//const bookid = process.argv[2];
const bookid = 676
let bookdata = fs.readFileSync('../'+bookid+'.txt', 'utf8')
//bookdata = bookdata.replace(/\r\n/g,'\n')
if(/\r/.test(bookdata)){
    console.log('\\r\\n to \\n')
    process.exit(1)
  }

// [^？。，、“”\d：（）《》！；\-——]$

// ([^？。，IⅡⅢV、“”\d：…（）\n《》！；\-——」])\n\n

// ​1 ​9 ​4

let reg = /　/g
// \n\n\n\n\n\n.+(?<![。？\.\-])\n
reg = /\n((第.部分.*)|(第[一二三四五六七八九十]{1,3}章.*)|([0-9]{1,2})|([一二三四五六七八九十]、.*))\n/g
reg = /\n((第.部 .*)|(第[0-9]{1,2}章 .*)|(\n\n\n\n\n.+(?<![。？\.\-])))\n/g
reg = /\n((第.部 .*)|(第[0-9]{1,2}章 .*))\n/g
reg = /\n((第.篇 .*)|(第[0-9]{1,2}章 .*))\n/g
reg = /\n((第.部分 .*)|(第[0-9]{1,2}章 .*)|([0-9]{1,2}))\n/g
reg = /\n(([上中下]编 .*)|(第.部分 .*)|(第[一二三四五六七八九十]{1,3}章 .*))\n/g
reg = /\n(([上中下]编 .*)|(第.部分 .*)|(第[一二三四五六七八九十]{1,3}章)|([0-9]{1,2}))\n/g
reg = /\n((卷[一二三四五六七八九十]{1,3}))\n/g
reg = /\n([一二三四五六七八九十]{1,3} .*)\n/g
reg = /\n((第.部分)|(第[一二三四五六七八九十]{1,3}章)|([0-9]{1,2}))\n/g
reg = /\n(卷　上|卷　下|补　遗|附　录|[一二三四五六七八九十]{1,3})\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}回.*|[一二三四五六七八九十]{1,3}、.*)\n/g
reg = /\n(第.{1,2}篇 .*|[一二三四五六七八九十]{1,3})\n/g
reg = /\n(.+(?<![。]))\n/g
reg = /\n(..部|..第.)\n/g
reg = /\n(第.卷|第.{1,5}回 ....... .......)\n/g
reg = /\n(([一二三四五六七八九十]{1,3}　.*)|(第[一二三四五六七八九十]{1,3}章)　.*|([0-9]{1,2}))\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}章 .*|第[一二三四五六七八九十]{1,3}节 .*)\n/g
reg = /\n(.|..|...)\n/g
reg = /\n([0-9]{1,3})\n/g
reg = /\n(([^。^”^•^\s]){1,20})\n/g
reg = /\n(周易正義|楚辭洪興祖補註|[一二三四五六七八九十〇]{1,3} .*)\n/g
reg = /\n(第[一二三四五六七八九十百零〇]{1,5}章)\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}章 .*|[一二三四五六七八九十]{1,3}、.{2,50})\n/g
reg = /\n(([一二三四五六七八九十]{1,3} .*)|([0-9]{1,5})|【注释】)\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}章 .*|[一二三四五六七八九十]{1,3}、.*|（[一二三四五六七八九十]）.*)\n/g
reg = /\n([一二三四五六七八九十]{1,3}|第\d\d章)\n/g
reg = /\n(第[0-9]{1,5}章　.*|[一二三四五六七八九十百零]　.*)\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}章 .*|[一二三四五六七八九十百零])\n/g
reg = /\n(一九[五六][一二三四五六七八九十百零〇]年|[一二三四五六七八九十][一二]?月.{3,30})\n/g
reg = /\n(附录[一二三四五].*|第[一二三四五六七八九十百零]{1,5}章.*|[一二三四五六七八九十〇]{1,3}、.*)\n/g
reg = /\n(第[一二三四五六七八九十百零]{1,5}[篇章] .*|[0-9]{1,5})\n/g
reg = /\n(([一二三四五六七八九十]{1,3}、.*)|([0-9]{1,5}))\n/g
reg = /\n(.*[^？。，IⅡⅢV、“”\d：…（）\n《》！；\-——」])\n/g
reg = /\n(第[0-9]{1,5}卷|第[一二三四五六七八九十百零]{1,5}章　.*|[一二三四五六七八九十〇]{1,3})\n/g
reg = /\n(上|徐爱录|陆澄录|后记|[一二三四五六七八九十〇]{1,3}|[0-9]{1,3})\n/g
reg = /\n(第\d{1,5}章 .*|第[一二三四五六七八九十百零]{1,5}[则] .*)\n/g
reg = /\n(卷.{1,3} .*)\n/g
reg = /\n(.{2,3})\n/g
reg = /\n(卷一 走天涯克全子孝 感异梦始获亲骸|卷二 马元美为儿求淑女 唐长姑聘妹配衰翁|卷三 解己囊惠周合邑 受人托信著远方|卷四 活全家愿甘降辱 徇大节始显清贞|卷五 执国法直臣锄恶 造冤狱奸小害良|卷六 愚百姓人招假婿 贤县主天配良缘|卷七 仗义施恩非望报 临危获救适相酬|卷八 御群凶顿遭惨变 动公愤始雪奇冤|卷九 赔遗金暗中获隽 拒美色眼下登科|卷十 图葬地诡联秦晋 欺贫女怒触雷霆|卷十一 诈平民恃官灭法 置美妾藉妓营生|卷十二 骤荣华顿忘夙誓 变异类始悔前非|卷十三 争嗣议力折群言 冒贪名阴行厚德|卷十四 遇赏音穷途吐气 酬知己狱底抒忠|卷十五 堕奸谋险遭屠割 感梦兆巧脱网罗|卷十六 方正士活判幽魂 恶孽人死遭冥责|第.{1,3}回)\n/g





const chaps = bookdata.match(reg)

chaps.map(v=>console.log('　　　'+v.trim()))


